<a href="https://colab.research.google.com/github/afraniofilho/Python-Training-Ford/blob/main/Python_Pill_2_iterrows_numpy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame([['nome1','endereco1'],['nome2','endereco2'],['nome3','endereco3']],columns=['Nome','Endereco'])

In [3]:
df

    Nome   Endereco
0  nome1  endereco1
1  nome2  endereco2
2  nome3  endereco3

In [4]:
for row in df.iterrows():
  print(row)

(0, Nome            nome1
Endereco    endereco1
Name: 0, dtype: object)
(1, Nome            nome2
Endereco    endereco2
Name: 1, dtype: object)
(2, Nome            nome3
Endereco    endereco3
Name: 2, dtype: object)

In [5]:
for row in df.iterrows():
  print(type(row))

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

In [8]:
for index, row in df.iterrows():
  print (index, '--> O nome é ', row['Nome'], ' o endereço é ', row.Endereco)

0 --> O nome é  nome1  o endereço é  endereco1
1 --> O nome é  nome2  o endereço é  endereco2
2 --> O nome é  nome3  o endereço é  endereco3

In [9]:
# Mudar o nome para Afranio se o valor for igual a 'nome2'

In [12]:
for index, row in df.iterrows():
  if row.Nome == 'nome2':
    df.at[index, 'Nome'] = 'Afranio'
    print(index, '--> O nome é ', row.Nome, 'o endereço é ', row.Endereco)

1 --> O nome é  Afranio o endereço é  endereco2

In [14]:
df

      Nome   Endereco
0    nome1  endereco1
1  Afranio  endereco2
2    nome3  endereco3

In [15]:
def iterrow_exemplo(df, col):
  for index, row in df.iterrows():
    val = row[col]
    if val == 'nome1':
      df.at[index, col] = 'Afranio'

In [16]:
iterrow_exemplo(df, 'Nome')

In [17]:
df

      Nome   Endereco
0  Afranio  endereco1
1  Afranio  endereco2
2    nome3  endereco3

In [18]:
# Comparação entre diferentes métodos de iteração no DF

In [19]:
import numpy as np

In [20]:
df_num = pd.DataFrame(np.random.rand(10000, 5), columns=('A', 'B', 'C', 'D', 'E'))

In [21]:
df_num.describe()

                  A             B             C             D             E
count  10000.000000  10000.000000  1.000000e+04  10000.000000  10000.000000
mean       0.499826      0.502433  5.006053e-01      0.501276      0.501002
std        0.287562      0.289263  2.895641e-01      0.288621      0.289507
min        0.000081      0.000088  6.363315e-07      0.000060      0.000040
25%        0.253003      0.253293  2.486076e-01      0.249735      0.252538
50%        0.495931      0.503846  4.996508e-01      0.504229      0.497265
75%        0.746762      0.752039  7.541294e-01      0.753035      0.752344
max        0.999791      0.999969  9.998900e-01      0.999944      0.999931

In [26]:
def iterrow_num(df, col):
  for index, row in df.iterrows():
    val = row[col]
    if val < 0.5:
      df.at[index, col] = 0
    else:
      df.at[index, col] = 1

In [28]:
df_num.head()

     A         B         C         D         E
0  0.0  0.029498  0.371377  0.810214  0.814635
1  0.0  0.419456  0.156788  0.595035  0.117795
2  1.0  0.938377  0.191147  0.175736  0.342807
3  0.0  0.420704  0.117217  0.427948  0.265408
4  0.0  0.725309  0.721789  0.112800  0.527871

In [27]:
%timeit iterrow_num(df_num, 'A')

1 loop, best of 5: 674 ms per loop

In [29]:
%timeit df_num['B'] = np.where(df_num['B'] < 0.5, 0, 1)

The slowest run took 58.66 times longer than the fastest. This could mean that an intermediate result is being cached.
1000 loops, best of 5: 411 µs per loop

In [31]:
%timeit df_num['C'] = np.where(df_num['C'].values < 0.5, 0, 1)

The slowest run took 5.74 times longer than the fastest. This could mean that an intermediate result is being cached.
10000 loops, best of 5: 175 µs per loop

In [32]:
df_num.head()

     A  B  C         D         E
0  0.0  0  0  0.810214  0.814635
1  0.0  0  0  0.595035  0.117795
2  1.0  1  0  0.175736  0.342807
3  0.0  0  0  0.427948  0.265408
4  0.0  1  1  0.112800  0.527871

In [33]:
df

      Nome   Endereco
0  Afranio  endereco1
1  Afranio  endereco2
2    nome3  endereco3

In [34]:
df['Nome'] = np.where(df['Nome'] == 'nome3', 'Afranio', df['Nome'].values)

In [35]:
df

      Nome   Endereco
0  Afranio  endereco1
1  Afranio  endereco2
2  Afranio  endereco3

In [36]:
df.to_csv('csvexemplo.csv')